#include "Ground.h"

void Ground::Init()
{
//===================================================================
// 画像
//===================================================================
	//ポインタの実体化
	m_Model = std::make_shared<KdModelData>();
	//モデルの読み込み
	m_Model->Load("Asset/Model/Ground/Ground.gltf");

//===================================================================
//初期設定 
//===================================================================
	//===座標===
	m_Pos = { 0,0,0 };

//===================================================================
//当たり判定 
//===================================================================
	//当たり判定用ポインタを実体化
	m_pCollider = std::make_unique<KdCollider>();
	//モデルの形状で当たり判定を登録
	m_pCollider->RegisterCollisionShape(
		"Ground",
		m_Model,
		KdCollider::TypeGround
	);
}

void Ground::Update()
{
//===================================================================
//行列 
//===================================================================
	//拡縮
	Math::Matrix _scale = Math::Matrix::CreateScale(1,1,1);
	//移動
	Math::Matrix _trans = Math::Matrix::CreateTranslation(m_Pos);
	//合成
	m_mWorld = _scale * _trans;
}

void Ground::DrawLit()
{
//===================================================================
//描画 
//===================================================================
	KdShaderManager::Instance().m_StandardShader.DrawModel(*m_Model, m_mWorld);
}